In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('raw_kathmandu_post/tweets.csv', low_memory=False)

In [5]:
list(df)

['id',
 'conversation_id',
 'created_at',
 'date',
 'time',
 'timezone',
 'user_id',
 'username',
 'name',
 'place',
 'tweet',
 'language',
 'mentions',
 'urls',
 'photos',
 'replies_count',
 'retweets_count',
 'likes_count',
 'hashtags',
 'cashtags',
 'link',
 'retweet',
 'quote_url',
 'video',
 'thumbnail',
 'near',
 'geo',
 'source',
 'user_rt_id',
 'user_rt',
 'retweet_id',
 'reply_to',
 'retweet_date',
 'translate',
 'trans_src',
 'trans_dest']

In [8]:
df = df[['id', 'date', 'tweet', 'time', 'urls']]

In [14]:
df.shape

(104850, 5)

In [15]:
df.head()

,id,date,tweet,time,urls
0,1384858205365411843,2021-04-21,Nepali politicians are losing their moral comp...,19:00:00,['http://tkpo.st/3txH6mG']
1,1384842930247057408,2021-04-21,"Nepal’s Covid-19 toll reaches 3,112 with 10 mo...",17:59:18,['https://tkpo.st/3syl55P']
2,1384835556098682880,2021-04-21,As many as 67 vultures found dead in Jitpur I...,17:30:00,['https://tkpo.st/3eqpPFU']
3,1384830522984222722,2021-04-21,EDITORIAL: Online classes for some The pandem...,17:10:00,['http://tkpo.st/3sBsVM9']
4,1384825924521140225,2021-04-21,Twitter becomes platform of hope amid the desp...,16:51:43,['https://tkpo.st/3xcw9cv']

In [16]:
df.tail()

,id,date,tweet,time,urls
104845,221099243107123201,2012-07-06,Integration of former combatants into Nepal Ar...,10:17:22,['http://fb.me/1MWLksOI5']
104846,221098935278772228,2012-07-06,Why make fuss of a confident PM after he hobno...,10:16:08,['http://fb.me/VKxnhs4N']
104847,221098156455247876,2012-07-06,The buzz over budget by Former Finance Ministe...,10:13:02,['http://fb.me/1Rwoo1bnG']
104848,221097419788664833,2012-07-06,Government plans to allocate Rs. 10 billion fo...,10:10:07,['http://fb.me/1JWfS9vGM']
104849,221095350692352000,2012-07-06,"Is it possible, CA reinstatement for 27 minute...",10:01:54,['http://fb.me/28ZaLyQv7']

In [13]:
df.groupby('date')[['id']].count()

            id
date
2012-07-06  22
2012-07-07  22
2012-07-08  11
2012-07-09  20
2012-07-10   3
...         ..
2021-04-22  62
2021-04-23  56
2021-04-24  52
2021-04-25  48
2021-04-26  11

[2678 rows x 1 columns]

In [ ]:
df.groupby('date')[['id']].count().plot()